web-api/src/test/resources/input/userDefinedBoostFieldValueMissing.xml

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE s [
<!ENTITY x "hello">
]>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <searchRequest>
      <query><![CDATA[danmark]]> and &x;</query>
      <agency>100200</agency>
      <profile>test</profile>
      <callback>cb</callback>
      <userDefinedBoost>
        <fieldName>dkcclterm.fo</fieldName>
        <!-- fieldValue is a required property of userDefinedBoost -->
        <weight>2</weight>
      </userDefinedBoost>
      <collectionType>work-1</collectionType>
    </searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
